export const js = `
  initLifeInstructor()
  function initLifeInstructor() {
    var geolocation = new qq.maps.Geolocation("OB4BZ-D4W3U-B7VVO-4PJWW-6TKDJ-WPB77", "myapp");
    var options = { timeout: 8000, accuracy: 1000 };
    var positionNum = 0;
    if (navigator.geolocation) {
      geolocation.getLocation(
        function showPosition(position) {
          positionNum++;
          var lat = position.lat; //纬度
          var lon = position.lng; //经度

          var fc40Url = getWeather40DayApiUrl(lon, lat)
          if (fc40Url) {
            ajax({ url: fc40Url }, function (responseText) {
              var index3d = getWeather40DayApiIndex3d(responseText)
              renderLifeInstructor(index3d)
            })
          } else {
            renderLifeInstructor()
          }
        }, function showError(error) {
          console.log(error)
        }, options)
    } else {
      alert("浏览器不支持地理定位");
    }
  }
  function renderLifeInstructor(index3d) {
    index3d = index3d || {
      "i": [
        {
          "i1": "ac",
          "i2": "空调开启指数",
          "i3": "",
          "i4": "部分时间开启",
          "i5": "天气热，到中午的时候您将会感到有点热，因此建议在午后较热时开启制冷空调。",
          "i6": "部分时间开启",
          "i7": "天气热，到中午的时候您将会感到有点热，因此建议在午后较热时开启制冷空调。",
          "i8": "部分时间开启",
          "i9": "天气热，到中午的时候您将会感到有点热，因此建议在午后较热时开启制冷空调。",
          "i10": "部分时间开启",
          "i11": "天气热，到中午的时候您将会感到有点热，因此建议在午后较热时开启制冷空调。",
          "i12": "部分时间开启",
          "i13": "天气热，到中午的时候您将会感到有点热，因此建议在午后较热时开启制冷空调。",
          "i14": "部分时间开启",
          "i15": "天气热，到中午的时候您将会感到有点热，因此建议在午后较热时开启制冷空调。",
          "i16": "部分时间开启",
          "i17": "天气热，到中午的时候您将会感到有点热，因此建议在午后较热时开启制冷空调。"
        },
        {
          "i1": "ag",
          "i2": "过敏指数",
          "i3": "",
          "i4": "易发",
          "i5": "天气条件易诱发过敏，易过敏人群应减少外出，外出宜穿长衣长裤并佩戴好眼镜和口罩，外出归来时及时清洁手和口鼻。",
          "i6": "易发",
          "i7": "天气条件易诱发过敏，易过敏人群应减少外出，外出宜穿长衣长裤并佩戴好眼镜和口罩，外出归来时及时清洁手和口鼻。",
          "i8": "易发",
          "i9": "天气条件易诱发过敏，易过敏人群应减少外出，外出宜穿长衣长裤并佩戴好眼镜和口罩，外出归来时及时清洁手和口鼻。",
          "i10": "易发",
          "i11": "天气条件易诱发过敏，易过敏人群应减少外出，外出宜穿长衣长裤并佩戴好眼镜和口罩，外出归来时及时清洁手和口鼻。",
          "i12": "易发",
          "i13": "天气条件易诱发过敏，易过敏人群应减少外出，外出宜穿长衣长裤并佩戴好眼镜和口罩，外出归来时及时清洁手和口鼻。",
          "i14": "易发",
          "i15": "天气条件易诱发过敏，易过敏人群应减少外出，外出宜穿长衣长裤并佩戴好眼镜和口罩，外出归来时及时清洁手和口鼻。",
          "i16": "易发",
          "i17": "天气条件易诱发过敏，易过敏人群应减少外出，外出宜穿长衣长裤并佩戴好眼镜和口罩，外出归来时及时清洁手和口鼻。"
        },
        {
          "i1": "cl",
          "i2": "晨练指数",
          "i3": "",
          "i4": "较适宜",
          "i5": "早晨气象条件较适宜晨练，但风力稍大，晨练时请注意选择避风的地点，避免迎风锻炼。",
          "i6": "较适宜",
          "i7": "早晨气象条件较适宜晨练，但风力稍大，晨练时请注意选择避风的地点，避免迎风锻炼。",
          "i8": "较适宜",
          "i9": "早晨气象条件较适宜晨练，但风力稍大，晨练时请注意选择避风的地点，避免迎风锻炼。",
          "i10": "较适宜",
          "i11": "早晨气象条件较适宜晨练，但风力稍大，晨练时请注意选择避风的地点，避免迎风锻炼。",
          "i12": "较适宜",
          "i13": "早晨气象条件较适宜晨练，但风力稍大，晨练时请注意选择避风的地点，避免迎风锻炼。",
          "i14": "较适宜",
          "i15": "早晨气象条件较适宜晨练，但风力稍大，晨练时请注意选择避风的地点，避免迎风锻炼。",
          "i16": "较适宜",
          "i17": "早晨气象条件较适宜晨练，但风力稍大，晨练时请注意选择避风的地点，避免迎风锻炼。"
        },
        {
          "i1": "co",
          "i2": "舒适度指数",
          "i3": "",
          "i4": "较舒适",
          "i5": "白天天气晴好，您在这种天气条件下，会感觉早晚凉爽、舒适，午后偏热。",
          "i6": "较舒适",
          "i7": "白天天气晴好，您在这种天气条件下，会感觉早晚凉爽、舒适，午后偏热。",
          "i8": "较舒适",
          "i9": "白天天气晴好，您在这种天气条件下，会感觉早晚凉爽、舒适，午后偏热。",
          "i10": "较舒适",
          "i11": "白天天气晴好，您在这种天气条件下，会感觉早晚凉爽、舒适，午后偏热。",
          "i12": "较舒适",
          "i13": "白天天气晴好，您在这种天气条件下，会感觉早晚凉爽、舒适，午后偏热。",
          "i14": "较舒适",
          "i15": "白天天气晴好，您在这种天气条件下，会感觉早晚凉爽、舒适，午后偏热。",
          "i16": "较舒适",
          "i17": "白天天气晴好，您在这种天气条件下，会感觉早晚凉爽、舒适，午后偏热。"
        },
        {
          "i1": "ct",
          "i2": "穿衣指数",
          "i3": "",
          "i4": "热",
          "i5": "天气热，建议着短裙、短裤、短薄外套、T恤等夏季服装。",
          "i6": "热",
          "i7": "天气热，建议着短裙、短裤、短薄外套、T恤等夏季服装。",
          "i8": "热",
          "i9": "天气热，建议着短裙、短裤、短薄外套、T恤等夏季服装。",
          "i10": "热",
          "i11": "天气热，建议着短裙、短裤、短薄外套、T恤等夏季服装。",
          "i12": "热",
          "i13": "天气热，建议着短裙、短裤、短薄外套、T恤等夏季服装。",
          "i14": "热",
          "i15": "天气热，建议着短裙、短裤、短薄外套、T恤等夏季服装。",
          "i16": "热",
          "i17": "天气热，建议着短裙、短裤、短薄外套、T恤等夏季服装。"
        },
        {
          "i1": "dy",
          "i2": "钓鱼指数",
          "i3": "",
          "i4": "较适宜",
          "i5": "较适合垂钓，但天气稍热，会对垂钓产生一定的影响。",
          "i6": "较适宜",
          "i7": "较适合垂钓，但天气稍热，会对垂钓产生一定的影响。",
          "i8": "较适宜",
          "i9": "较适合垂钓，但天气稍热，会对垂钓产生一定的影响。",
          "i10": "较适宜",
          "i11": "较适合垂钓，但天气稍热，会对垂钓产生一定的影响。",
          "i12": "较适宜",
          "i13": "较适合垂钓，但天气稍热，会对垂钓产生一定的影响。",
          "i14": "较适宜",
          "i15": "较适合垂钓，但天气稍热，会对垂钓产生一定的影响。",
          "i16": "较适宜",
          "i17": "较适合垂钓，但天气稍热，会对垂钓产生一定的影响。"
        },
        {
          "i1": "fs",
          "i2": "防晒指数",
          "i3": "",
          "i4": "中等",
          "i5": "属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。",
          "i6": "中等",
          "i7": "属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。",
          "i8": "中等",
          "i9": "属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。",
          "i10": "中等",
          "i11": "属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。",
          "i12": "中等",
          "i13": "属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。",
          "i14": "中等",
          "i15": "属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。",
          "i16": "中等",
          "i17": "属中等强度紫外辐射天气，外出时应注意防护，建议涂擦SPF指数高于15，PA+的防晒护肤品。"
        },
        {
          "i1": "gj",
          "i2": "逛街指数",
          "i3": "",
          "i4": "较适宜",
          "i5": "天气较好，虽然风力较大，还是较适宜逛街的。",
          "i6": "较适宜",
          "i7": "天气较好，虽然风力较大，还是较适宜逛街的。",
          "i8": "较适宜",
          "i9": "天气较好，虽然风力较大，还是较适宜逛街的。",
          "i10": "较适宜",
          "i11": "天气较好，虽然风力较大，还是较适宜逛街的。",
          "i12": "较适宜",
          "i13": "天气较好，虽然风力较大，还是较适宜逛街的。",
          "i14": "较适宜",
          "i15": "天气较好，虽然风力较大，还是较适宜逛街的。",
          "i16": "较适宜",
          "i17": "天气较好，虽然风力较大，还是较适宜逛街的。"
        },
        {
          "i1": "gm",
          "i2": "感冒指数",
          "i3": "",
          "i4": "少发",
          "i5": "各项气象条件适宜，发生感冒机率较低。但请避免长期处于空调房间中，以防感冒。",
          "i6": "少发",
          "i7": "各项气象条件适宜，发生感冒机率较低。但请避免长期处于空调房间中，以防感冒。",
          "i8": "少发",
          "i9": "各项气象条件适宜，发生感冒机率较低。但请避免长期处于空调房间中，以防感冒。",
          "i10": "少发",
          "i11": "各项气象条件适宜，发生感冒机率较低。但请避免长期处于空调房间中，以防感冒。",
          "i12": "少发",
          "i13": "各项气象条件适宜，发生感冒机率较低。但请避免长期处于空调房间中，以防感冒。",
          "i14": "少发",
          "i15": "各项气象条件适宜，发生感冒机率较低。但请避免长期处于空调房间中，以防感冒。",
          "i16": "少发",
          "i17": "各项气象条件适宜，发生感冒机率较低。但请避免长期处于空调房间中，以防感冒。"
        },
        {
          "i1": "hc",
          "i2": "划船指数",
          "i3": "",
          "i4": "较适宜",
          "i5": "白天较适宜划船，但较大的风力会对划船产生一定的影响。",
          "i6": "较适宜",
          "i7": "白天较适宜划船，但较大的风力会对划船产生一定的影响。",
          "i8": "较适宜",
          "i9": "白天较适宜划船，但较大的风力会对划船产生一定的影响。",
          "i10": "较适宜",
          "i11": "白天较适宜划船，但较大的风力会对划船产生一定的影响。",
          "i12": "较适宜",
          "i13": "白天较适宜划船，但较大的风力会对划船产生一定的影响。",
          "i14": "较适宜",
          "i15": "白天较适宜划船，但较大的风力会对划船产生一定的影响。",
          "i16": "较适宜",
          "i17": "白天较适宜划船，但较大的风力会对划船产生一定的影响。"
        },
        {
          "i1": "jt",
          "i2": "交通指数",
          "i3": "",
          "i4": "良好",
          "i5": "天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。",
          "i6": "良好",
          "i7": "天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。",
          "i8": "良好",
          "i9": "天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。",
          "i10": "良好",
          "i11": "天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。",
          "i12": "良好",
          "i13": "天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。",
          "i14": "良好",
          "i15": "天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。",
          "i16": "良好",
          "i17": "天气较好，路面干燥，交通气象条件良好，车辆可以正常行驶。"
        },
        {
          "i1": "lk",
          "i2": "路况指数",
          "i3": "",
          "i4": "干燥",
          "i5": "天气较好，路面比较干燥，路况较好。",
          "i6": "干燥",
          "i7": "天气较好，路面比较干燥，路况较好。",
          "i8": "干燥",
          "i9": "天气较好，路面比较干燥，路况较好。",
          "i10": "干燥",
          "i11": "天气较好，路面比较干燥，路况较好。",
          "i12": "干燥",
          "i13": "天气较好，路面比较干燥，路况较好。",
          "i14": "干燥",
          "i15": "天气较好，路面比较干燥，路况较好。",
          "i16": "干燥",
          "i17": "天气较好，路面比较干燥，路况较好。"
        },
        {
          "i1": "ls",
          "i2": "晾晒指数",
          "i3": "",
          "i4": "适宜",
          "i5": "天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！",
          "i6": "适宜",
          "i7": "天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！",
          "i8": "适宜",
          "i9": "天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！",
          "i10": "适宜",
          "i11": "天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！",
          "i12": "适宜",
          "i13": "天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！",
          "i14": "适宜",
          "i15": "天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！",
          "i16": "适宜",
          "i17": "天气不错，适宜晾晒。赶紧把久未见阳光的衣物搬出来吸收一下太阳的味道吧！"
        },
        {
          "i1": "mf",
          "i2": "美发指数",
          "i3": "",
          "i4": "一般",
          "i5": "头发需要保持清洁，同时要注意防晒，含防晒成分洗发护发品是很好的选择。",
          "i6": "一般",
          "i7": "头发需要保持清洁，同时要注意防晒，含防晒成分洗发护发品是很好的选择。",
          "i8": "一般",
          "i9": "头发需要保持清洁，同时要注意防晒，含防晒成分洗发护发品是很好的选择。",
          "i10": "一般",
          "i11": "头发需要保持清洁，同时要注意防晒，含防晒成分洗发护发品是很好的选择。",
          "i12": "一般",
          "i13": "头发需要保持清洁，同时要注意防晒，含防晒成分洗发护发品是很好的选择。",
          "i14": "一般",
          "i15": "头发需要保持清洁，同时要注意防晒，含防晒成分洗发护发品是很好的选择。",
          "i16": "一般",
          "i17": "头发需要保持清洁，同时要注意防晒，含防晒成分洗发护发品是很好的选择。"
        },
        {
          "i1": "nl",
          "i2": "夜生活指数",
          "i3": "",
          "i4": "较适宜",
          "i5": "天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。",
          "i6": "较适宜",
          "i7": "天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。",
          "i8": "较适宜",
          "i9": "天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。",
          "i10": "较适宜",
          "i11": "天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。",
          "i12": "较适宜",
          "i13": "天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。",
          "i14": "较适宜",
          "i15": "天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。",
          "i16": "较适宜",
          "i17": "天气较好，虽然有点风，但仍比较适宜夜生活，您可以放心外出。"
        },
        {
          "i1": "pj",
          "i2": "啤酒指数",
          "i3": "",
          "i4": "适宜",
          "i5": "炎热的天气可能增加啤酒对您的诱惑，适量饮用啤酒会给您带来清凉的感觉，但千万注意不要过量呦！",
          "i6": "适宜",
          "i7": "炎热的天气可能增加啤酒对您的诱惑，适量饮用啤酒会给您带来清凉的感觉，但千万注意不要过量呦！",
          "i8": "适宜",
          "i9": "炎热的天气可能增加啤酒对您的诱惑，适量饮用啤酒会给您带来清凉的感觉，但千万注意不要过量呦！",
          "i10": "适宜",
          "i11": "炎热的天气可能增加啤酒对您的诱惑，适量饮用啤酒会给您带来清凉的感觉，但千万注意不要过量呦！",
          "i12": "适宜",
          "i13": "炎热的天气可能增加啤酒对您的诱惑，适量饮用啤酒会给您带来清凉的感觉，但千万注意不要过量呦！",
          "i14": "适宜",
          "i15": "炎热的天气可能增加啤酒对您的诱惑，适量饮用啤酒会给您带来清凉的感觉，但千万注意不要过量呦！",
          "i16": "适宜",
          "i17": "炎热的天气可能增加啤酒对您的诱惑，适量饮用啤酒会给您带来清凉的感觉，但千万注意不要过量呦！"
        },
        {
          "i1": "pk",
          "i2": "放风筝指数",
          "i3": "",
          "i4": "适宜",
          "i5": "天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。",
          "i6": "适宜",
          "i7": "天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。",
          "i8": "适宜",
          "i9": "天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。",
          "i10": "适宜",
          "i11": "天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。",
          "i12": "适宜",
          "i13": "天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。",
          "i14": "适宜",
          "i15": "天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。",
          "i16": "适宜",
          "i17": "天气不错，这种天气去放风筝既可以舒展筋骨，又可放松身心，超然自逸于广袤的天地之间。"
        },
        {
          "i1": "pl",
          "i2": "空气污染扩散条件指数",
          "i3": "",
          "i4": "良",
          "i5": "气象条件有利于空气污染物稀释、扩散和清除，可在室外正常活动。",
          "i6": "良",
          "i7": "气象条件有利于空气污染物稀释、扩散和清除，可在室外正常活动。",
          "i8": "良",
          "i9": "气象条件有利于空气污染物稀释、扩散和清除，可在室外正常活动。",
          "i10": "良",
          "i11": "气象条件有利于空气污染物稀释、扩散和清除，可在室外正常活动。",
          "i12": "良",
          "i13": "气象条件有利于空气污染物稀释、扩散和清除，可在室外正常活动。",
          "i14": "良",
          "i15": "气象条件有利于空气污染物稀释、扩散和清除，可在室外正常活动。",
          "i16": "良",
          "i17": "气象条件有利于空气污染物稀释、扩散和清除，可在室外正常活动。"
        },
        {
          "i1": "pp",
          "i2": "化妆指数",
          "i3": "",
          "i4": "去油防晒",
          "i5": "建议用蜜质SPF15以上面霜打底，水质无油粉底霜。",
          "i6": "去油防晒",
          "i7": "建议用蜜质SPF15以上面霜打底，水质无油粉底霜。",
          "i8": "去油防晒",
          "i9": "建议用蜜质SPF15以上面霜打底，水质无油粉底霜。",
          "i10": "去油防晒",
          "i11": "建议用蜜质SPF15以上面霜打底，水质无油粉底霜。",
          "i12": "去油防晒",
          "i13": "建议用蜜质SPF15以上面霜打底，水质无油粉底霜。",
          "i14": "去油防晒",
          "i15": "建议用蜜质SPF15以上面霜打底，水质无油粉底霜。",
          "i16": "去油防晒",
          "i17": "建议用蜜质SPF15以上面霜打底，水质无油粉底霜。"
        },
        {
          "i1": "tr",
          "i2": "旅游指数",
          "i3": "",
          "i4": "适宜",
          "i5": "天气较好，温度稍高，幸好风稍大，会缓解稍热的天气。适宜旅游，可不要错过机会呦！",
          "i6": "适宜",
          "i7": "天气较好，温度稍高，幸好风稍大，会缓解稍热的天气。适宜旅游，可不要错过机会呦！",
          "i8": "适宜",
          "i9": "天气较好，温度稍高，幸好风稍大，会缓解稍热的天气。适宜旅游，可不要错过机会呦！",
          "i10": "适宜",
          "i11": "天气较好，温度稍高，幸好风稍大，会缓解稍热的天气。适宜旅游，可不要错过机会呦！",
          "i12": "适宜",
          "i13": "天气较好，温度稍高，幸好风稍大，会缓解稍热的天气。适宜旅游，可不要错过机会呦！",
          "i14": "适宜",
          "i15": "天气较好，温度稍高，幸好风稍大，会缓解稍热的天气。适宜旅游，可不要错过机会呦！",
          "i16": "适宜",
          "i17": "天气较好，温度稍高，幸好风稍大，会缓解稍热的天气。适宜旅游，可不要错过机会呦！"
        },
        {
          "i1": "uv",
          "i2": "紫外线强度指数",
          "i3": "",
          "i4": "中等",
          "i5": "属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。",
          "i6": "中等",
          "i7": "属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。",
          "i8": "中等",
          "i9": "属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。",
          "i10": "中等",
          "i11": "属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。",
          "i12": "中等",
          "i13": "属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。",
          "i14": "中等",
          "i15": "属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。",
          "i16": "中等",
          "i17": "属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。"
        },
        {
          "i1": "wc",
          "i2": "风寒指数",
          "i3": "",
          "i4": "无",
          "i5": "温度未达到风寒所需的低温，稍作防寒准备即可。",
          "i6": "无",
          "i7": "温度未达到风寒所需的低温，稍作防寒准备即可。",
          "i8": "无",
          "i9": "温度未达到风寒所需的低温，稍作防寒准备即可。",
          "i10": "无",
          "i11": "温度未达到风寒所需的低温，稍作防寒准备即可。",
          "i12": "无",
          "i13": "温度未达到风寒所需的低温，稍作防寒准备即可。",
          "i14": "无",
          "i15": "温度未达到风寒所需的低温，稍作防寒准备即可。",
          "i16": "无",
          "i17": "温度未达到风寒所需的低温，稍作防寒准备即可。"
        },
        {
          "i1": "xc",
          "i2": "洗车指数",
          "i3": "",
          "i4": "较适宜",
          "i5": "较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。",
          "i6": "较适宜",
          "i7": "较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。",
          "i8": "较适宜",
          "i9": "较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。",
          "i10": "较适宜",
          "i11": "较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。",
          "i12": "较适宜",
          "i13": "较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。",
          "i14": "较适宜",
          "i15": "较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。",
          "i16": "较适宜",
          "i17": "较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。"
        },
        {
          "i1": "xq",
          "i2": "心情指数",
          "i3": "",
          "i4": "较差",
          "i5": "天气较好，气温较高，会让人觉得有些烦躁，注意室内通风降温，保持心态平和，给自己的情绪“降降温”。",
          "i6": "较差",
          "i7": "天气较好，气温较高，会让人觉得有些烦躁，注意室内通风降温，保持心态平和，给自己的情绪“降降温”。",
          "i8": "较差",
          "i9": "天气较好，气温较高，会让人觉得有些烦躁，注意室内通风降温，保持心态平和，给自己的情绪“降降温”。",
          "i10": "较差",
          "i11": "天气较好，气温较高，会让人觉得有些烦躁，注意室内通风降温，保持心态平和，给自己的情绪“降降温”。",
          "i12": "较差",
          "i13": "天气较好，气温较高，会让人觉得有些烦躁，注意室内通风降温，保持心态平和，给自己的情绪“降降温”。",
          "i14": "较差",
          "i15": "天气较好，气温较高，会让人觉得有些烦躁，注意室内通风降温，保持心态平和，给自己的情绪“降降温”。",
          "i16": "较差",
          "i17": "天气较好，气温较高，会让人觉得有些烦躁，注意室内通风降温，保持心态平和，给自己的情绪“降降温”。"
        },
        {
          "i1": "yd",
          "i2": "运动指数",
          "i3": "",
          "i4": "较适宜",
          "i5": "天气较好，但因气温较高且风力较强，请适当降低运动强度并注意户外防风。",
          "i6": "较适宜",
          "i7": "天气较好，但因气温较高且风力较强，请适当降低运动强度并注意户外防风。",
          "i8": "较适宜",
          "i9": "天气较好，但因气温较高且风力较强，请适当降低运动强度并注意户外防风。",
          "i10": "较适宜",
          "i11": "天气较好，但因气温较高且风力较强，请适当降低运动强度并注意户外防风。",
          "i12": "较适宜",
          "i13": "天气较好，但因气温较高且风力较强，请适当降低运动强度并注意户外防风。",
          "i14": "较适宜",
          "i15": "天气较好，但因气温较高且风力较强，请适当降低运动强度并注意户外防风。",
          "i16": "较适宜",
          "i17": "天气较好，但因气温较高且风力较强，请适当降低运动强度并注意户外防风。"
        },
        {
          "i1": "yh",
          "i2": "约会指数",
          "i3": "",
          "i4": "较不适宜",
          "i5": "天气较好，且室外有风，外出约会可能会让恋人受些苦，最好在温暖的室内促膝谈心。",
          "i6": "较不适宜",
          "i7": "天气较好，且室外有风，外出约会可能会让恋人受些苦，最好在温暖的室内促膝谈心。",
          "i8": "较不适宜",
          "i9": "天气较好，且室外有风，外出约会可能会让恋人受些苦，最好在温暖的室内促膝谈心。",
          "i10": "较不适宜",
          "i11": "天气较好，且室外有风，外出约会可能会让恋人受些苦，最好在温暖的室内促膝谈心。",
          "i12": "较不适宜",
          "i13": "天气较好，且室外有风，外出约会可能会让恋人受些苦，最好在温暖的室内促膝谈心。",
          "i14": "较不适宜",
          "i15": "天气较好，且室外有风，外出约会可能会让恋人受些苦，最好在温暖的室内促膝谈心。",
          "i16": "较不适宜",
          "i17": "天气较好，且室外有风，外出约会可能会让恋人受些苦，最好在温暖的室内促膝谈心。"
        },
        {
          "i1": "ys",
          "i2": "雨伞指数",
          "i3": "",
          "i4": "不带伞",
          "i5": "天气较好，不会降水，因此您可放心出门，无须带雨伞。",
          "i6": "不带伞",
          "i7": "天气较好，不会降水，因此您可放心出门，无须带雨伞。",
          "i8": "不带伞",
          "i9": "天气较好，不会降水，因此您可放心出门，无须带雨伞。",
          "i10": "不带伞",
          "i11": "天气较好，不会降水，因此您可放心出门，无须带雨伞。",
          "i12": "不带伞",
          "i13": "天气较好，不会降水，因此您可放心出门，无须带雨伞。",
          "i14": "不带伞",
          "i15": "天气较好，不会降水，因此您可放心出门，无须带雨伞。",
          "i16": "不带伞",
          "i17": "天气较好，不会降水，因此您可放心出门，无须带雨伞。"
        },
        {
          "i1": "zs",
          "i2": "中暑指数",
          "i3": "",
          "i4": "少发",
          "i5": "气温偏高，有可能中暑，体质较弱的朋友请注意防暑降温，避免长时间在日光下暴晒或在高温环境中工作。",
          "i6": "少发",
          "i7": "气温偏高，有可能中暑，体质较弱的朋友请注意防暑降温，避免长时间在日光下暴晒或在高温环境中工作。",
          "i8": "少发",
          "i9": "气温偏高，有可能中暑，体质较弱的朋友请注意防暑降温，避免长时间在日光下暴晒或在高温环境中工作。",
          "i10": "少发",
          "i11": "气温偏高，有可能中暑，体质较弱的朋友请注意防暑降温，避免长时间在日光下暴晒或在高温环境中工作。",
          "i12": "少发",
          "i13": "气温偏高，有可能中暑，体质较弱的朋友请注意防暑降温，避免长时间在日光下暴晒或在高温环境中工作。",
          "i14": "少发",
          "i15": "气温偏高，有可能中暑，体质较弱的朋友请注意防暑降温，避免长时间在日光下暴晒或在高温环境中工作。",
          "i16": "少发",
          "i17": "气温偏高，有可能中暑，体质较弱的朋友请注意防暑降温，避免长时间在日光下暴晒或在高温环境中工作。"
        },
        {
          "i1": "gl",
          "i2": "太阳镜指数",
          "i3": "",
          "i4": "必要",
          "i5": "白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜",
          "i6": "必要",
          "i7": "白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜",
          "i8": "必要",
          "i9": "白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜",
          "i10": "必要",
          "i11": "白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜",
          "i12": "必要",
          "i13": "白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜",
          "i14": "必要",
          "i15": "白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜",
          "i16": "必要",
          "i17": "白天太阳辐射较强，建议佩戴透射比1级且标注UV380-UV400的浅色太阳镜"
        },
        {
          "i1": "rw",
          "i2": "减肥气象指数",
          "i3": "",
          "i4": "一颗星",
          "i5": "天热风大，可选择低强度运动。",
          "i6": "一颗星",
          "i7": "天热风大，可选择低强度运动。",
          "i8": "一颗星",
          "i9": "天热风大，可选择低强度运动。",
          "i10": "一颗星",
          "i11": "天热风大，可选择低强度运动。",
          "i12": "一颗星",
          "i13": "天热风大，可选择低强度运动。",
          "i14": "一颗星",
          "i15": "天热风大，可选择低强度运动。",
          "i16": "一颗星",
          "i17": "天热风大，可选择低强度运动。"
        }
      ],
      "i0": "201805290800"
    }
    var data = parseIndex3d(index3d)

    var xcEl = document.getElementById('lifeInstructorXc')
    var clEl = document.getElementById('lifeInstructorCl')
    var uvEl = document.getElementById('lifeInstructorUv')
    var ctEl = document.getElementById('lifeInstructorCt')
    var gmEl = document.getElementById('lifeInstructorGm')
    var trEl = document.getElementById('lifeInstructorTr')
    var dyEl = document.getElementById('lifeInstructorDy')
    var gjEl = document.getElementById('lifeInstructorGj')

    xcEl.innerText = data.xc
    clEl.innerText = data.cl
    uvEl.innerText = data.uv
    ctEl.innerText = data.ct
    gmEl.innerText = data.gm
    trEl.innerText = data.tr
    dyEl.innerText = data.dy
    gjEl.innerText = data.gj
  }
`
export const html = `
  <div class="liOuter">
    <div class="liHeader">
      <span>生活指数</span>
    </div>
    <div class="liMain">
      <div class="liItem">
        <span class="ssicon"></span>
        <span class="liItemContent" id="lifeInstructorXc">不宜洗车</span>
      </div>
      <div class="liItem">
        <span class="ssicon cl"></span>
        <span class="liItemContent" id="lifeInstructorCl">不宜晨练</span>
      </div>
      <div class="liItem">
        <span class="ssicon zyx"></span>
        <span class="liItemContent" id="lifeInstructorUv">紫外线弱</span>
      </div>
      <div class="liItem">
        <span class="ssicon cy"></span>
        <span class="liItemContent" id="lifeInstructorCt">冷</span>
      </div>
      <div class="liItem">
        <span class="ssicon gm"></span>
        <span class="liItemContent" id="lifeInstructorGm">少发感冒</span>
      </div>
      <div class="liItem">
        <span class="ssicon cx"></span>
        <span class="liItemContent" id="lifeInstructorTr">出行良好</span>
      </div>
      <div class="liItem">
        <span class="ssicon dy"></span>
        <span class="liItemContent" id="lifeInstructorDy">钓鱼不宜</span>
      </div>
      <div class="liItem">
        <span class="ssicon gj"></span>
        <span class="liItemContent" id="lifeInstructorGj">较适宜逛街</span>
      </div>
    </div>
  </div>
`
export const css = `
    .liOuter {
      color: #fff;
      font-size: 1.3rem;
    }

    .liHeader {
      padding: 20px;
      border-bottom: 1px solid #999;
    }

    .liMain {
      overflow: hidden;
    }

    .liItem {
      font-size: 1rem;
      box-sizing: border-box;
      padding: 6% 0px;
      width: 50%;
      float: left;
      display: flex;
      flex-direction: row;
      align-items: center;
      border-bottom: 1px solid #999;
      padding-left: 8%;
    }

    .liItemContent {
      margin-left: 5%;
    }
  `
